app/controllers/bairros_controller.rb

SELECT "bairros".* FROM "bairros"
---
  def index
    @bairros = Bairro.all

INSERT INTO "bairros" ("nome", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome", "Santa Nilce"], ["created_at", 2017-04-20 20:36:46 UTC], ["updated_at", 2017-04-20 20:36:46 UTC]]
---
  def create
    @bairro = Bairro.new(bairro_params)

    respond_to do |format|
      if @bairro.save

SELECT  "bairros".* FROM "bairros" WHERE "bairros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_bairro
      @bairro = Bairro.find(params[:id])