app/controllers/carteirinhas_controller.rb

SELECT "carteirinhas".* FROM "carteirinhas"
---
  def index
    @carteirinhas = Carteirinha.all