app/controllers/cids_controller.rb

  def index
    @cids = Cid.all
---
SELECT "cids".* FROM "cids"