app/controllers/datalogs_controller.rb

  def index
    @datalogs = Datalog.all
---
SELECT "datalogs".* FROM "datalogs"