app/controllers/documentos_controller.rb

  def index
    @documentos = Documento.all
---
SELECT "documentos".* FROM "documentos"