app/controllers/enderecos_controller.rb

  def index
    @enderecos = Endereco.all
---
SELECT "enderecos".* FROM "enderecos"