app/controllers/funcionarios_controller.rb

SELECT "funcionarios".* FROM "funcionarios"
---
  def index
    @funcionarios = Funcionario.all

INSERT INTO "funcionarios" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2017-04-20 20:36:31 UTC], ["updated_at", 2017-04-20 20:36:31 UTC]]
---
  def create
    @funcionario = Funcionario.new(funcionario_params)

    respond_to do |format|
      if @funcionario.save

SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_funcionario
      @funcionario = Funcionario.find(params[:id])