app/controllers/logins_controller.rb

SELECT "logins".* FROM "logins"
---
  def index
    @logins = Login.all