app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT "pessoas".* FROM "pessoas"